[
    {
        "from": "ai",
        "text": "Hi! How are you feeling today?"
    },
    {
        "from": "user",
        "text": "Honestly, I just feel a bit off, but don't know why."
    },
    {
        "from": "ai",
        "text": "It's okay to feel that way sometimes. Want to share what's been on your mind?"
    },
    {
        "from": "user",
        "text": "It's just college life, you know? On one hand, I'm grateful to be here, but on the other, it's just a lot sometimes."
    },
    {
        "from": "ai",
        "text": "Balancing everything can definitely be overwhelming. What parts of college life are weighing on you the most right now?"
    },
    {
        "from": "user",
        "text": "I guess it's the social part. I see my friends hanging out without me sometimes, and it just makes me feel... left out."
    },
    {
        "from": "ai",
        "text": "Feeling left out is tough. Have you talked to your friends about how this makes you feel?"
    },
    {
        "from": "user",
        "text": "Not really, I don't want to act like a needy person. Other than that, I’ve also been struggling with my classes a bit more than usual."
    },
    {
        "from": "ai",
        "text": "It’s important to express your feelings, even if it feels uncomfortable. As for your classes, could it help to set up a study schedule or seek some tutoring?"
    },
    {
        "from": "user",
        "text": "Maybe, I haven’t really thought about tutoring. I just usually get through on my own."
    },
    {
        "from": "ai",
        "text": "It might be worth trying. Sometimes, a little guidance can make a big difference. How are you managing your downtime?"
    },
    {
        "from": "user",
        "text": "Downtime? What’s that? But seriously, I spend most of it just scrolling through stuff online or worrying about what I should be doing."
    },
    {
        "from": "ai",
        "text": "It sounds like you might not be giving yourself a real break. Maybe intentionally setting time aside to relax could help? Something like reading, or maybe getting outside for a bit?"
    },
    {
        "from": "user",
        "text": "I used to read a lot before college. Maybe I could get back into that. Thanks for the suggestion."
    },
    {
        "from": "ai",
        "text": "Returning to something you love could definitely help! It's all about taking small steps. If you ever feel overwhelmed, I’m here to talk."
    },
    {
        "from": "user",
        "text": "I appreciate it. It's been nice to have a chat with someone."
    },
    {
        "from": "ai",
        "text": "Anytime! Remember, taking care of your mental health is just as important as your physical health. I'm here whenever you need."
    }
]
